it/src/Documents/СписаниеОС/СписаниеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеОС</name>
  <registerRecords>AccumulationRegister.РазмещениеЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.СписаныеОС</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/AccumulationRegisters/РазмещениеЛицензий/РазмещениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеЛицензий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУстановлено</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/AccumulationRegisters/РазмещениеОбъектов/РазмещениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеОбъектов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПризнакУчета</name>
    <type>
      <types>EnumRef.ПризнакУчетаПрограмм</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКомпьютера</name>
    <type>
      <types>CatalogRef.ОбъектыКомпьютера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/Enums/ПризнакУчетаПрограмм/ПризнакУчетаПрограмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакУчетаПрограмм</name>
  <enumValues>
    <name>Удалить</name>
  </enumValues>
  <enumValues>
    <name>НеУчитывать</name>
  </enumValues>
  <enumValues>
    <name>Учитывать</name>
  </enumValues>
  <enumValues>
    <name>НеОпределено</name>
  </enumValues>
</mdclass:Enum>

it/src/Enums/ВариантДействияПриДеинсталяции/ВариантДействияПриДеинсталяции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантДействияПриДеинсталяции</name>
  <enumValues>
    <name>Удалять</name>
  </enumValues>
  <enumValues>
    <name>Освобождать</name>
  </enumValues>
</mdclass:Enum>

it/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоСредства</name>
    <type>
      <types>CatalogRef.ВидыОсновногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/Documents/СписаниеОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуТаблицаСписанныхОС(СтруктураШапкиДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОСОсновныеСредства.Ссылка КАК Регистратор,
	               |	СписаниеОСОсновныеСредства.Ссылка.Дата КАК ДатаСписания,
	               |	СписаниеОСОсновныеСредства.ОсновноеСредство
	               |ИЗ
	               |	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
	               |ГДЕ
	               |	СписаниеОСОсновныеСредства.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()


Функция ПолучитьТаблицуРаспределениеЛицензий(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	СписаниеОСОсновныеСредства.ОсновноеСредство
				   |ПОМЕСТИТЬ втКомпьютеры
				   |ИЗ
				   |	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
				   |ГДЕ
				   |	СписаниеОСОсновныеСредства.Ссылка = &Регистратор
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РазмещениеЛицензийОстатки.ИдентификаторКомпьютера,
				   |	РазмещениеЛицензийОстатки.ИдентификаторПрограммы,
				   |	РазмещениеЛицензийОстатки.КоличествоОстаток КАК Количество,
				   |	&Регистратор,
				   |	&Период,
				   |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				   |	ИСТИНА КАК Активность,
				   |	РазмещениеЛицензийОстатки.Организация,
				   |	РазмещениеЛицензийОстатки.ПодразделениеОрганизации,
				   |	РазмещениеЛицензийОстатки.ИдентификаторУстановлено,
				   |	РазмещениеЛицензийОстатки.Лицензия
				   |ИЗ
				   |	РегистрНакопления.РазмещениеЛицензий.Остатки(
				   |			&МоментВремени,
				   |			ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
				   |				И ИдентификаторКомпьютера В
				   |					(ВЫБРАТЬ
				   |						втКомпьютеры.ОсновноеСредство
				   |					ИЗ
				   |						втКомпьютеры КАК втКомпьютеры)) КАК РазмещениеЛицензийОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДополнительныеСвойства.ДляПроведения.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Период", ДополнительныеСвойства.ДляПроведения.Дата);
	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Возврат(Запрос.Выполнить().Выгрузить());
	
 КонецФункции //ПолучитьТаблицуРаспределениеЛицензий	
 
 
Функция ПолучитьТаблицуРазмещенияОбъектов(ДополнительныеСвойства)	Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	СписаниеОСОсновныеСредства.ОсновноеСредство
					|ПОМЕСТИТЬ втКомпьютеры
					|ИЗ
					|	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
					|ГДЕ
					|	СписаниеОСОсновныеСредства.Ссылка = &Регистратор
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
					|	РазмещениеОбъектовОстатки.ИдентификаторПрограммы,
					|	РазмещениеОбъектовОстатки.ОбъектКомпьютера,
					|	РазмещениеОбъектовОстатки.КоличествоОстаток КАК Количество,
					|	&Регистратор,
					|	&Период,
					|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
					|	ИСТИНА КАК Активность,
					|	РазмещениеОбъектовОстатки.ИдентификаторДомена
					|ИЗ
					|	РегистрНакопления.РазмещениеОбъектов.Остатки(
					|			&МоментВремени,
					|			ИдентификаторКомпьютера В
					|				(ВЫБРАТЬ
					|					втКомпьютеры.ОсновноеСредство
					|				ИЗ
					|					втКомпьютеры КАК втКомпьютеры)) КАК РазмещениеОбъектовОстатки";
					
					
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДополнительныеСвойства.ДляПроведения.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Период", ДополнительныеСвойства.ДляПроведения.Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции	 


Функция ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства) Экспорт
	
	Действие = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Действие при деинсталяции");
	ТаблицаРаспределения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРаспределениеЛицензий;
	
	ТаблицаЛицензииОрганизации = ТаблицаРаспределения.СкопироватьКолонки();
	Для каждого Строка Из ТаблицаРаспределения Цикл
		
		НайденнаяСтрока = Строка.Лицензия.ДополнительныеРеквизиты.Найти(Действие, "Свойство");
		
		Если НайденнаяСтрока.Значение = Перечисления.ВариантДействияПриДеинсталяции.Освобождать Тогда
			
			НоваяСтрока = ТаблицаЛицензииОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ТаблицаЛицензииОрганизации;
	
КонецФункции //ПолучитьТаблицуЛицензииОрганизации	


Функция ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОСОсновныеСредства.Ссылка КАК Регистратор,
	               |	СписаниеОСОсновныеСредства.Ссылка.Дата КАК Период,
	               |	СписаниеОСОсновныеСредства.ОсновноеСредство,
	               |	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОСВладелец,
	               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеОрганизации,
	               |	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК МОЛ,
	               |	ЗНАЧЕНИЕ(Справочник.Помещение.ПустаяСсылка) КАК Помещение
	               |ИЗ
	               |	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
	               |ГДЕ
	               |	СписаниеОСОсновныеСредства.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
 КонецФункции // ПолучитьТаблицуКомплектующих()
 
 // <Описание функции>
 //
 // Параметры
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ПолучитьТаблицуОтключенныеКомпьютеры(ДополнительныеСвойства) Экспорт
 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОСОсновныеСредства.Ссылка КАК Регистратор,
	               |	СписаниеОСОсновныеСредства.Ссылка.Дата КАК Период,
	               |	СписаниеОСОсновныеСредства.ОсновноеСредство КАК ИдентификаторКомпьютера,
	               |	ИСТИНА КАК Отключен
	               |ИЗ
	               |	Документ.СписаниеОС.ОсновныеСредства КАК СписаниеОСОсновныеСредства
	               |ГДЕ
	               |	СписаниеОСОсновныеСредства.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
 
 КонецФункции // ПолучитьТаблицуОтключенныеКомпьютеры()
  

// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Возвращает заголовок документа для печатной формы.
//
// Параметры:
//  Шапка - любая структура с полями:
//           Номер         - Строка или Число - номер документа;
//           Дата          - Дата - дата документа;
//           Представление - Строка - (необязательный) платформенное представление ссылки на документ.
//                                    Если параметр НазваниеДокумента не задан, то название документа будет вычисляться
//                                    из этого параметра.
//  НазваниеДокумента - Строка - название документа (например, "Счет на оплату").
//
// Возвращаемое значение:
//  Строка - заголовок документа
//
Функция СформироватьЗаголовокДокумента(Шапка, Знач НазваниеДокумента = "") Экспорт
	
	ДанныеДокумента = Новый Структура("Номер,Дата,Представление");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Шапка);
	
	// Если название документа не передано, получим название по представлению документа
	Если ПустаяСтрока(НазваниеДокумента) И ЗначениеЗаполнено(ДанныеДокумента.Представление) Тогда
		ПоложениеНомера = Найти(ДанныеДокумента.Представление, ДанныеДокумента.Номер);
		Если ПоложениеНомера > 0 Тогда
			НазваниеДокумента = СокрЛП(Лев(ДанныеДокумента.Представление, ПоложениеНомера - 1));
		КонецЕсли;
	КонецЕсли;

	НомерНаПечать = ДанныеДокумента.Номер;
	СтандартнаяОбработка = Истина;
	ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(НомерНаПечать, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		НомерНаПечать = ДанныеДокумента.Номер;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 № %2 от %3'"),
		НазваниеДокумента, НомерНаПечать, Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	
КонецФункции

Функция ПечатьСписаниеОС(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_СписаниеОС";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеОС.Ссылка,
	               |	СписаниеОС.ОсновныеСредства.(
	               |		НомерСтроки,
	               |		ОсновноеСредство.Наименование КАК ОсновноеСредство,
	               |		Комментарий
	               |	),
	               |	СписаниеОС.Дата,
	               |	СписаниеОС.Номер,
	               |	СписаниеОС.Комментарий,
	               |	СписаниеОС.Ответственный
	               |ИЗ
	               |	Документ.СписаниеОС КАК СписаниеОС
	               |ГДЕ
	               |	СписаниеОС.Ссылка В(&МассивОбъектов)";
				   
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.СписаниеОС.ПФ_MXL_СписаниеОС");
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			//Все документы необходимо выводить  на разных страницах
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		//Запомним номер строки, с которой начали выводить текущий документ
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура;
		
		ТекстЗаголовка = СформироватьЗаголовокДокумента(Шапка, "Списание основных средств");
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("Комментарий", Шапка.Комментарий);
		ДанныеПечати.Вставить("Ответственный", Шапка.Ответственный);
		
		ТаблицаОсновныеСредства = Шапка.ОсновныеСредства.Выгрузить();
		
		МассивОбластейМакета = Новый Массив;
		
		//Если ИмяМакета = "СписаниеОС" Тогда
		//	МассивОбластейМакета.Добавить("ЗаголовокСчета");
		//КонецЕсли;
		МассивОбластейМакета.Добавить("Заголовок");
		//МассивОбластейМакета.Добавить("Поставщик");
		//МассивОбластейМакета.Добавить("Покупатель");
		МассивОбластейМакета.Добавить("ШапкаТаблицы");
		МассивОбластейМакета.Добавить("Строка");
		//МассивОбластейМакета.Добавить("Итого");
		//МассивОбластейМакета.Добавить("ИтогоНДС");
		//МассивОбластейМакета.Добавить("СуммаПрописью");
		МассивОбластейМакета.Добавить("Подвал");
		
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			Если ИмяОбласти <> "Строка" Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Иначе
				Для Каждого СтрокаТаблицы Из ТаблицаОсновныеСредства Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;

		//В табличном документе необходимо задать имя области,  в которую был
		// выведен объект. Необходимо для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.СписаниеОС";
	КомандаПечати.Идентификатор = "СписаниеОС";
	КомандаПечати.Представление = НСтр("ru = 'Списание основных средств'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписаниеОС");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"СписаниеОС",
		НСтр("ru = 'Списание основных средств'"),
		ПечатьСписаниеОС(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеОС.ПФ_MXL_СписаниеОС");
	КонецЕсли;	



КонецПроцедуры
